---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.CentralModelVersionArchivedException
source: html/47ddcbe2-f3b7-46b1-cc69-3586cc33aedc.htm
---
# CentralModelVersionArchivedException Methods

Retrieves data needed to serialize the target object.